{
  "content": "<h4> Welcome to Version 2 of Parking Winds Visualizer. This version is currently in production and features are still being added.</h4>\n<h4> This page is phase 1 of the PWV, focusing on a complete front end remake using a dynamic map instead of premade images. As such, only information present\non the original page is present here, until Phase 2 starts, which is a overhaul of the backend server to add more features.\n</h4>\n<p>\nAll wind data is obtained from AviationWeather.gov's <a href=\"https://aviationweather.gov/data/api/\">Data API</a>. Temperature information is obtained\nfrom <a href=\"https://www.tomorrow.io/\">Tomorrow.io API v4 </a> with limited usage plan of 500 requests per day.\n<ul>\n\n    <h5>Change Log</h5>\n    <li>\n        Moved most of the information to a sidebar to reduce clutter on the main page\n        Wind Icon: Buttons to select wind data.\n        Text Icon: METAR and TAF data.\n        Airplane Icon: Unit selection.\n    </li>\n    <li>\n        Added some basic mobile responsiveness. The sidebar will start collapsed on smaller screens\n    </li>\n    <li>\n        BUG FIX: Fixed an issue where unable to load error would occur if any wind component was missing or variable (i.e. not a number)\n    </li>\n\n<li>\n    <h5 class=\"bi bi-caret-right-fill\">CURRENT WORKING FEATURES</h5></i>\n</li>\n<li>Street and Satellite Maps available</li>\n<li>Full TAF and METAR data available</li>\n<li>Toggle between current winds, current gusts, the most prevelant wind and the highest forcasted gusts in the next 24 hours</li>\n<li>Replaced arrows with wind barbs. A quick refresher on wind barbs:\n    <ul>\n        <li>Winds are coming from the direction of the barbs, TOWARDS the center of the aircraft. Imagine the line is an arrow and the barbs are the feathers</li>\n        <li>Each long barb represents 10 knots</li>\n        <li>Each short barb represents 5 knots</li>\n        <li>Each triangle represents 50 knots</li>\n    </ul>\n</li>\n<li>\n    <h5>IN DEVELOPMENT FEATURES FROM VERSION 1.0</h5>\n</li>\n<li>Recreating the information panel to include time periods of expected wind catagories</li>\n<li>Incorporating temperature</li>\n<li>Wind and Temperature warnings</li>\n<li>\n    <h5>UPCOMING FEATURES</h5>\n    Thanks to the new dynamic map, I can now add more features that were not possible in the original version. These include:\n</li>\n<li> Easier incorporation of new units through an on map system to point and click on parking spots and add to the database.</li>\n<li> Realtime weather over-layed over the map</li>\n<li> More customization</li>\n\n</ul>\n\n<p>If you have any suggestions, feedback or encounter any bugs, feel free to contact me at jedensuscg@gmail.com, or if you are familiar\nwith Github, create an issue <br>\nView the source code or report issues on my <a href=\"https://github.com/jedensuscg/parking-winds\" target=\"_blank\">Github</a>\n</p>\n</p>"
}
